###################################################################

# Created by write_sdc on Tue Jun  2 14:34:47 2009

###################################################################
set sdc_version 1.4

set_max_area 0
set_load -pin_load 0.01 [get_ports decoded_bit_out]
set_load -pin_load 0.01 [get_ports {wdata_out[63]}]
set_load -pin_load 0.01 [get_ports {wdata_out[62]}]
set_load -pin_load 0.01 [get_ports {wdata_out[61]}]
set_load -pin_load 0.01 [get_ports {wdata_out[60]}]
set_load -pin_load 0.01 [get_ports {wdata_out[59]}]
set_load -pin_load 0.01 [get_ports {wdata_out[58]}]
set_load -pin_load 0.01 [get_ports {wdata_out[57]}]
set_load -pin_load 0.01 [get_ports {wdata_out[56]}]
set_load -pin_load 0.01 [get_ports {wdata_out[55]}]
set_load -pin_load 0.01 [get_ports {wdata_out[54]}]
set_load -pin_load 0.01 [get_ports {wdata_out[53]}]
set_load -pin_load 0.01 [get_ports {wdata_out[52]}]
set_load -pin_load 0.01 [get_ports {wdata_out[51]}]
set_load -pin_load 0.01 [get_ports {wdata_out[50]}]
set_load -pin_load 0.01 [get_ports {wdata_out[49]}]
set_load -pin_load 0.01 [get_ports {wdata_out[48]}]
set_load -pin_load 0.01 [get_ports {wdata_out[47]}]
set_load -pin_load 0.01 [get_ports {wdata_out[46]}]
set_load -pin_load 0.01 [get_ports {wdata_out[45]}]
set_load -pin_load 0.01 [get_ports {wdata_out[44]}]
set_load -pin_load 0.01 [get_ports {wdata_out[43]}]
set_load -pin_load 0.01 [get_ports {wdata_out[42]}]
set_load -pin_load 0.01 [get_ports {wdata_out[41]}]
set_load -pin_load 0.01 [get_ports {wdata_out[40]}]
set_load -pin_load 0.01 [get_ports {wdata_out[39]}]
set_load -pin_load 0.01 [get_ports {wdata_out[38]}]
set_load -pin_load 0.01 [get_ports {wdata_out[37]}]
set_load -pin_load 0.01 [get_ports {wdata_out[36]}]
set_load -pin_load 0.01 [get_ports {wdata_out[35]}]
set_load -pin_load 0.01 [get_ports {wdata_out[34]}]
set_load -pin_load 0.01 [get_ports {wdata_out[33]}]
set_load -pin_load 0.01 [get_ports {wdata_out[32]}]
set_load -pin_load 0.01 [get_ports {wdata_out[31]}]
set_load -pin_load 0.01 [get_ports {wdata_out[30]}]
set_load -pin_load 0.01 [get_ports {wdata_out[29]}]
set_load -pin_load 0.01 [get_ports {wdata_out[28]}]
set_load -pin_load 0.01 [get_ports {wdata_out[27]}]
set_load -pin_load 0.01 [get_ports {wdata_out[26]}]
set_load -pin_load 0.01 [get_ports {wdata_out[25]}]
set_load -pin_load 0.01 [get_ports {wdata_out[24]}]
set_load -pin_load 0.01 [get_ports {wdata_out[23]}]
set_load -pin_load 0.01 [get_ports {wdata_out[22]}]
set_load -pin_load 0.01 [get_ports {wdata_out[21]}]
set_load -pin_load 0.01 [get_ports {wdata_out[20]}]
set_load -pin_load 0.01 [get_ports {wdata_out[19]}]
set_load -pin_load 0.01 [get_ports {wdata_out[18]}]
set_load -pin_load 0.01 [get_ports {wdata_out[17]}]
set_load -pin_load 0.01 [get_ports {wdata_out[16]}]
set_load -pin_load 0.01 [get_ports {wdata_out[15]}]
set_load -pin_load 0.01 [get_ports {wdata_out[14]}]
set_load -pin_load 0.01 [get_ports {wdata_out[13]}]
set_load -pin_load 0.01 [get_ports {wdata_out[12]}]
set_load -pin_load 0.01 [get_ports {wdata_out[11]}]
set_load -pin_load 0.01 [get_ports {wdata_out[10]}]
set_load -pin_load 0.01 [get_ports {wdata_out[9]}]
set_load -pin_load 0.01 [get_ports {wdata_out[8]}]
set_load -pin_load 0.01 [get_ports {wdata_out[7]}]
set_load -pin_load 0.01 [get_ports {wdata_out[6]}]
set_load -pin_load 0.01 [get_ports {wdata_out[5]}]
set_load -pin_load 0.01 [get_ports {wdata_out[4]}]
set_load -pin_load 0.01 [get_ports {wdata_out[3]}]
set_load -pin_load 0.01 [get_ports {wdata_out[2]}]
set_load -pin_load 0.01 [get_ports {wdata_out[1]}]
set_load -pin_load 0.01 [get_ports {wdata_out[0]}]
set_load -pin_load 0.01 [get_ports {addr0_out[4]}]
set_load -pin_load 0.01 [get_ports {addr0_out[3]}]
set_load -pin_load 0.01 [get_ports {addr0_out[2]}]
set_load -pin_load 0.01 [get_ports {addr0_out[1]}]
set_load -pin_load 0.01 [get_ports {addr0_out[0]}]
set_load -pin_load 0.01 [get_ports {addr1_out[4]}]
set_load -pin_load 0.01 [get_ports {addr1_out[3]}]
set_load -pin_load 0.01 [get_ports {addr1_out[2]}]
set_load -pin_load 0.01 [get_ports {addr1_out[1]}]
set_load -pin_load 0.01 [get_ports {addr1_out[0]}]
set_load -pin_load 0.01 [get_ports {addr2_out[4]}]
set_load -pin_load 0.01 [get_ports {addr2_out[3]}]
set_load -pin_load 0.01 [get_ports {addr2_out[2]}]
set_load -pin_load 0.01 [get_ports {addr2_out[1]}]
set_load -pin_load 0.01 [get_ports {addr2_out[0]}]
set_load -pin_load 0.01 [get_ports {addr3_out[4]}]
set_load -pin_load 0.01 [get_ports {addr3_out[3]}]
set_load -pin_load 0.01 [get_ports {addr3_out[2]}]
set_load -pin_load 0.01 [get_ports {addr3_out[1]}]
set_load -pin_load 0.01 [get_ports {addr3_out[0]}]
set_load -pin_load 0.01 [get_ports {addr4_out[4]}]
set_load -pin_load 0.01 [get_ports {addr4_out[3]}]
set_load -pin_load 0.01 [get_ports {addr4_out[2]}]
set_load -pin_load 0.01 [get_ports {addr4_out[1]}]
set_load -pin_load 0.01 [get_ports {addr4_out[0]}]
set_load -pin_load 0.01 [get_ports {addr5_out[4]}]
set_load -pin_load 0.01 [get_ports {addr5_out[3]}]
set_load -pin_load 0.01 [get_ports {addr5_out[2]}]
set_load -pin_load 0.01 [get_ports {addr5_out[1]}]
set_load -pin_load 0.01 [get_ports {addr5_out[0]}]
set_load -pin_load 0.01 [get_ports {we_out[5]}]
set_load -pin_load 0.01 [get_ports {we_out[4]}]
set_load -pin_load 0.01 [get_ports {we_out[3]}]
set_load -pin_load 0.01 [get_ports {we_out[2]}]
set_load -pin_load 0.01 [get_ports {we_out[1]}]
set_load -pin_load 0.01 [get_ports {we_out[0]}]
set_load -pin_load 0.01 [get_ports {cs_out[5]}]
set_load -pin_load 0.01 [get_ports {cs_out[4]}]
set_load -pin_load 0.01 [get_ports {cs_out[3]}]
set_load -pin_load 0.01 [get_ports {cs_out[2]}]
set_load -pin_load 0.01 [get_ports {cs_out[1]}]
set_load -pin_load 0.01 [get_ports {cs_out[0]}]
set_max_transition 0.6 [get_ports decoded_bit_out]
set_max_transition 0.6 [get_ports {wdata_out[63]}]
set_max_transition 0.6 [get_ports {wdata_out[62]}]
set_max_transition 0.6 [get_ports {wdata_out[61]}]
set_max_transition 0.6 [get_ports {wdata_out[60]}]
set_max_transition 0.6 [get_ports {wdata_out[59]}]
set_max_transition 0.6 [get_ports {wdata_out[58]}]
set_max_transition 0.6 [get_ports {wdata_out[57]}]
set_max_transition 0.6 [get_ports {wdata_out[56]}]
set_max_transition 0.6 [get_ports {wdata_out[55]}]
set_max_transition 0.6 [get_ports {wdata_out[54]}]
set_max_transition 0.6 [get_ports {wdata_out[53]}]
set_max_transition 0.6 [get_ports {wdata_out[52]}]
set_max_transition 0.6 [get_ports {wdata_out[51]}]
set_max_transition 0.6 [get_ports {wdata_out[50]}]
set_max_transition 0.6 [get_ports {wdata_out[49]}]
set_max_transition 0.6 [get_ports {wdata_out[48]}]
set_max_transition 0.6 [get_ports {wdata_out[47]}]
set_max_transition 0.6 [get_ports {wdata_out[46]}]
set_max_transition 0.6 [get_ports {wdata_out[45]}]
set_max_transition 0.6 [get_ports {wdata_out[44]}]
set_max_transition 0.6 [get_ports {wdata_out[43]}]
set_max_transition 0.6 [get_ports {wdata_out[42]}]
set_max_transition 0.6 [get_ports {wdata_out[41]}]
set_max_transition 0.6 [get_ports {wdata_out[40]}]
set_max_transition 0.6 [get_ports {wdata_out[39]}]
set_max_transition 0.6 [get_ports {wdata_out[38]}]
set_max_transition 0.6 [get_ports {wdata_out[37]}]
set_max_transition 0.6 [get_ports {wdata_out[36]}]
set_max_transition 0.6 [get_ports {wdata_out[35]}]
set_max_transition 0.6 [get_ports {wdata_out[34]}]
set_max_transition 0.6 [get_ports {wdata_out[33]}]
set_max_transition 0.6 [get_ports {wdata_out[32]}]
set_max_transition 0.6 [get_ports {wdata_out[31]}]
set_max_transition 0.6 [get_ports {wdata_out[30]}]
set_max_transition 0.6 [get_ports {wdata_out[29]}]
set_max_transition 0.6 [get_ports {wdata_out[28]}]
set_max_transition 0.6 [get_ports {wdata_out[27]}]
set_max_transition 0.6 [get_ports {wdata_out[26]}]
set_max_transition 0.6 [get_ports {wdata_out[25]}]
set_max_transition 0.6 [get_ports {wdata_out[24]}]
set_max_transition 0.6 [get_ports {wdata_out[23]}]
set_max_transition 0.6 [get_ports {wdata_out[22]}]
set_max_transition 0.6 [get_ports {wdata_out[21]}]
set_max_transition 0.6 [get_ports {wdata_out[20]}]
set_max_transition 0.6 [get_ports {wdata_out[19]}]
set_max_transition 0.6 [get_ports {wdata_out[18]}]
set_max_transition 0.6 [get_ports {wdata_out[17]}]
set_max_transition 0.6 [get_ports {wdata_out[16]}]
set_max_transition 0.6 [get_ports {wdata_out[15]}]
set_max_transition 0.6 [get_ports {wdata_out[14]}]
set_max_transition 0.6 [get_ports {wdata_out[13]}]
set_max_transition 0.6 [get_ports {wdata_out[12]}]
set_max_transition 0.6 [get_ports {wdata_out[11]}]
set_max_transition 0.6 [get_ports {wdata_out[10]}]
set_max_transition 0.6 [get_ports {wdata_out[9]}]
set_max_transition 0.6 [get_ports {wdata_out[8]}]
set_max_transition 0.6 [get_ports {wdata_out[7]}]
set_max_transition 0.6 [get_ports {wdata_out[6]}]
set_max_transition 0.6 [get_ports {wdata_out[5]}]
set_max_transition 0.6 [get_ports {wdata_out[4]}]
set_max_transition 0.6 [get_ports {wdata_out[3]}]
set_max_transition 0.6 [get_ports {wdata_out[2]}]
set_max_transition 0.6 [get_ports {wdata_out[1]}]
set_max_transition 0.6 [get_ports {wdata_out[0]}]
set_max_transition 0.6 [get_ports {addr0_out[4]}]
set_max_transition 0.6 [get_ports {addr0_out[3]}]
set_max_transition 0.6 [get_ports {addr0_out[2]}]
set_max_transition 0.6 [get_ports {addr0_out[1]}]
set_max_transition 0.6 [get_ports {addr0_out[0]}]
set_max_transition 0.6 [get_ports {addr1_out[4]}]
set_max_transition 0.6 [get_ports {addr1_out[3]}]
set_max_transition 0.6 [get_ports {addr1_out[2]}]
set_max_transition 0.6 [get_ports {addr1_out[1]}]
set_max_transition 0.6 [get_ports {addr1_out[0]}]
set_max_transition 0.6 [get_ports {addr2_out[4]}]
set_max_transition 0.6 [get_ports {addr2_out[3]}]
set_max_transition 0.6 [get_ports {addr2_out[2]}]
set_max_transition 0.6 [get_ports {addr2_out[1]}]
set_max_transition 0.6 [get_ports {addr2_out[0]}]
set_max_transition 0.6 [get_ports {addr3_out[4]}]
set_max_transition 0.6 [get_ports {addr3_out[3]}]
set_max_transition 0.6 [get_ports {addr3_out[2]}]
set_max_transition 0.6 [get_ports {addr3_out[1]}]
set_max_transition 0.6 [get_ports {addr3_out[0]}]
set_max_transition 0.6 [get_ports {addr4_out[4]}]
set_max_transition 0.6 [get_ports {addr4_out[3]}]
set_max_transition 0.6 [get_ports {addr4_out[2]}]
set_max_transition 0.6 [get_ports {addr4_out[1]}]
set_max_transition 0.6 [get_ports {addr4_out[0]}]
set_max_transition 0.6 [get_ports {addr5_out[4]}]
set_max_transition 0.6 [get_ports {addr5_out[3]}]
set_max_transition 0.6 [get_ports {addr5_out[2]}]
set_max_transition 0.6 [get_ports {addr5_out[1]}]
set_max_transition 0.6 [get_ports {addr5_out[0]}]
set_max_transition 0.6 [get_ports {we_out[5]}]
set_max_transition 0.6 [get_ports {we_out[4]}]
set_max_transition 0.6 [get_ports {we_out[3]}]
set_max_transition 0.6 [get_ports {we_out[2]}]
set_max_transition 0.6 [get_ports {we_out[1]}]
set_max_transition 0.6 [get_ports {we_out[0]}]
set_max_transition 0.6 [get_ports {cs_out[5]}]
set_max_transition 0.6 [get_ports {cs_out[4]}]
set_max_transition 0.6 [get_ports {cs_out[3]}]
set_max_transition 0.6 [get_ports {cs_out[2]}]
set_max_transition 0.6 [get_ports {cs_out[1]}]
set_max_transition 0.6 [get_ports {cs_out[0]}]
create_clock [get_ports clk]  -name MCLK  -period 50  -waveform {0 25}
set_clock_uncertainty 0.2  [get_clocks MCLK]
set_clock_transition -rise 0.6 [get_clocks MCLK]
set_clock_transition -fall 0.6 [get_clocks MCLK]
create_clock [get_pins u1/clk_div2_out]  -name SCLK  -period 100  -waveform {0 50}
set_clock_uncertainty 0.2  [get_clocks SCLK]
set_clock_transition -rise 0.6 [get_clocks SCLK]
set_clock_transition -fall 0.6 [get_clocks SCLK]
set_false_path   -from [get_ports reset_n]
set_input_delay -clock SCLK  -max 3  [get_ports reset_n]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in0[3]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in0[2]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in0[1]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in0[0]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in1[3]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in1[2]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in1[1]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in1[0]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in2[3]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in2[2]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in2[1]}]
set_input_delay -clock MCLK  -max 3  [get_ports {yn_in2[0]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[63]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[62]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[61]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[60]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[59]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[58]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[57]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[56]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[55]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[54]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[53]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[52]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[51]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[50]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[49]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[48]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[47]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[46]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[45]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[44]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[43]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[42]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[41]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[40]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[39]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[38]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[37]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[36]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[35]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[34]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[33]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[32]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[31]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[30]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[29]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[28]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[27]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[26]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[25]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[24]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[23]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[22]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[21]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[20]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[19]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[18]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[17]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[16]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[15]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[14]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[13]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[12]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[11]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[10]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[9]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[8]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[7]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[6]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[5]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[4]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[3]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[2]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[1]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata0_in[0]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[63]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[62]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[61]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[60]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[59]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[58]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[57]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[56]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[55]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[54]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[53]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[52]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[51]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[50]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[49]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[48]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[47]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[46]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[45]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[44]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[43]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[42]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[41]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[40]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[39]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[38]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[37]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[36]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[35]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[34]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[33]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[32]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[31]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[30]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[29]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[28]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[27]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[26]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[25]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[24]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[23]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[22]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[21]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[20]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[19]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[18]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[17]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[16]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[15]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[14]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[13]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[12]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[11]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[10]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[9]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[8]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[7]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[6]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[5]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[4]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[3]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[2]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[1]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata1_in[0]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[63]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[62]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[61]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[60]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[59]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[58]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[57]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[56]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[55]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[54]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[53]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[52]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[51]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[50]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[49]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[48]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[47]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[46]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[45]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[44]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[43]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[42]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[41]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[40]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[39]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[38]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[37]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[36]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[35]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[34]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[33]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[32]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[31]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[30]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[29]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[28]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[27]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[26]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[25]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[24]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[23]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[22]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[21]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[20]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[19]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[18]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[17]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[16]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[15]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[14]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[13]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[12]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[11]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[10]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[9]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[8]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[7]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[6]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[5]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[4]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[3]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[2]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[1]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata2_in[0]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[63]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[62]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[61]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[60]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[59]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[58]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[57]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[56]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[55]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[54]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[53]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[52]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[51]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[50]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[49]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[48]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[47]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[46]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[45]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[44]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[43]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[42]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[41]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[40]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[39]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[38]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[37]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[36]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[35]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[34]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[33]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[32]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[31]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[30]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[29]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[28]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[27]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[26]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[25]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[24]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[23]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[22]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[21]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[20]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[19]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[18]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[17]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[16]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[15]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[14]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[13]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[12]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[11]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[10]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[9]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[8]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[7]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[6]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[5]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[4]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[3]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[2]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[1]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata3_in[0]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[63]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[62]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[61]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[60]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[59]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[58]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[57]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[56]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[55]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[54]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[53]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[52]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[51]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[50]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[49]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[48]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[47]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[46]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[45]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[44]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[43]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[42]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[41]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[40]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[39]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[38]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[37]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[36]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[35]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[34]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[33]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[32]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[31]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[30]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[29]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[28]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[27]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[26]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[25]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[24]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[23]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[22]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[21]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[20]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[19]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[18]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[17]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[16]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[15]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[14]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[13]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[12]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[11]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[10]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[9]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[8]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[7]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[6]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[5]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[4]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[3]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[2]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[1]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata4_in[0]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[63]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[62]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[61]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[60]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[59]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[58]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[57]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[56]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[55]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[54]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[53]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[52]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[51]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[50]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[49]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[48]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[47]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[46]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[45]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[44]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[43]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[42]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[41]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[40]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[39]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[38]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[37]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[36]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[35]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[34]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[33]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[32]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[31]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[30]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[29]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[28]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[27]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[26]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[25]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[24]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[23]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[22]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[21]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[20]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[19]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[18]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[17]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[16]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[15]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[14]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[13]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[12]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[11]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[10]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[9]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[8]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[7]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[6]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[5]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[4]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[3]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[2]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[1]}]
set_input_delay -clock SCLK  -max 3  [get_ports {rdata5_in[0]}]
set_output_delay -clock SCLK  -max 3  [get_ports decoded_bit_out]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[63]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[62]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[61]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[60]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[59]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[58]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[57]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[56]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[55]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[54]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[53]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[52]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[51]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[50]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[49]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[48]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[47]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[46]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[45]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[44]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[43]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[42]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[41]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[40]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[39]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[38]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[37]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[36]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[35]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[34]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[33]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[32]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[31]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[30]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[29]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[28]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[27]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[26]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[25]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[24]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[23]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[22]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[21]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[20]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[19]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[18]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[17]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[16]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[15]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[14]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[13]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[12]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[11]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[10]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[9]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[8]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[7]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[6]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[5]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[4]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[3]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[2]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[1]}]
set_output_delay -clock SCLK  -max 3  [get_ports {wdata_out[0]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr0_out[4]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr0_out[3]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr0_out[2]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr0_out[1]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr0_out[0]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr1_out[4]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr1_out[3]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr1_out[2]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr1_out[1]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr1_out[0]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr2_out[4]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr2_out[3]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr2_out[2]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr2_out[1]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr2_out[0]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr3_out[4]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr3_out[3]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr3_out[2]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr3_out[1]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr3_out[0]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr4_out[4]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr4_out[3]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr4_out[2]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr4_out[1]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr4_out[0]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr5_out[4]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr5_out[3]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr5_out[2]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr5_out[1]}]
set_output_delay -clock SCLK  -max 3  [get_ports {addr5_out[0]}]
set_output_delay -clock SCLK  -max 3  [get_ports {we_out[5]}]
set_output_delay -clock SCLK  -max 3  [get_ports {we_out[4]}]
set_output_delay -clock SCLK  -max 3  [get_ports {we_out[3]}]
set_output_delay -clock SCLK  -max 3  [get_ports {we_out[2]}]
set_output_delay -clock SCLK  -max 3  [get_ports {we_out[1]}]
set_output_delay -clock SCLK  -max 3  [get_ports {we_out[0]}]
set_output_delay -clock SCLK  -max 3  [get_ports {cs_out[5]}]
set_output_delay -clock SCLK  -max 3  [get_ports {cs_out[4]}]
set_output_delay -clock SCLK  -max 3  [get_ports {cs_out[3]}]
set_output_delay -clock SCLK  -max 3  [get_ports {cs_out[2]}]
set_output_delay -clock SCLK  -max 3  [get_ports {cs_out[1]}]
set_output_delay -clock SCLK  -max 3  [get_ports {cs_out[0]}]
